import moment from "jalali-moment";
import { toast } from "react-toastify";

export const handleCopy = (value) => {
  if (navigator) {
    navigator.clipboard
      .writeText(value)
      .then(() => {
        toast.success("با موفقیت کپی شد");
      })
      .catch(() => {
        toast.error("کپی کردن با خطا مواجه شد");
      });
  }
};

export const provinces = [
  "البرز",
  "اردبیل",
  "بوشهر",
  "چهارمحال و بختیاری",
  "آذربایجان شرقی",
  "اصفهان",
  "فارس",
  "گیلان",
  "گلستان",
  "همدان",
  "هرمزگان",
  "ایلام",
  "کرمان",
  "کرمانشاه",
  "کهگیلویه و بویراحمد",
  "خراسان جنوبی",
  "خراسان رضوی",
  "خراسان شمالی",
  "خوزستان",
  "زنجان",
  "سمنان",
  "سیستان و بلوچستان",
  "تهران",
  "قزوین",
  "قم",
  "کردستان",
  "لرستان",
  "مرکزی",
  "مازندران",
  "آذربایجان غربی",
  "یزد",
];

export const cities = {
  البرز: ["کرج", "نظرآباد", "فردیس", "اشتهارد", "طالقان"],
  اردبیل: ["اردبیل", "مشگین‌شهر", "پارس‌آباد", "خلخال", "بیله‌سوار"],
  بوشهر: ["بوشهر", "برازجان", "کنگان", "جم", "دشتی"],
  "چهارمحال و بختیاری": ["شهرکرد", "فارسان", "بروجن", "لردگان", "کوهرنگ"],
  "آذربایجان شرقی": ["تبریز", "مراغه", "مرند", "میانه", "اهر"],
  اصفهان: ["اصفهان", "کاشان", "خمینی‌شهر", "نجف‌آباد", "شاهین‌شهر"],
  فارس: ["شیراز", "مرودشت", "جهرم", "لار", "فسا"],
  گیلان: ["رشت", "انزلی", "لاهیجان", "رودسر", "آستارا"],
  گلستان: ["گرگان", "گنبد کاووس", "علی‌آباد", "آق‌قلا", "کلاله"],
  همدان: ["همدان", "ملایر", "نهاوند", "تويسرکان", "کبودرآهنگ"],
  هرمزگان: ["بندرعباس", "قشم", "بندر لنگه", "میناب", "کیش"],
  ایلام: ["ایلام", "دهلران", "ایوان", "مهران", "آبدانان"],
  کرمان: ["کرمان", "رفسنجان", "جیرفت", "زرند", "سیرجان"],
  کرمانشاه: ["کرمانشاه", "اسلام‌آباد غرب", "هرسین", "سنقر", "قصر شیرین"],
  "کهگیلویه و بویراحمد": ["یاسوج", "دهدشت", "گچساران", "لیکک", "چرام"],
  "خراسان جنوبی": ["بیرجند", "قائن", "فردوس", "طبس", "نهبندان"],
  "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "کاشمر"],
  "خراسان شمالی": ["بجنورد", "شیروان", "اسفراین", "آشخانه", "فاروج"],
  خوزستان: ["اهواز", "آبادان", "خرمشهر", "دزفول", "ماهشهر"],
  زنجان: ["زنجان", "ابهر", "خرمدره", "سلطانیه", "قیدار"],
  سمنان: ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدی‌شهر"],
  "سیستان و بلوچستان": ["زاهدان", "چابهار", "زابل", "ایرانشهر", "خاش"],
  تهران: ["تهران", "ری", "شمیرانات", "ورامین", "پاکدشت"],
  قزوین: ["قزوین", "تاکستان", "بوئین‌زهرا", "آبیک", "الوند"],
  قم: ["قم", "جعفریه", "دستجرد", "سلفچگان", "کهک"],
  کردستان: ["سنندج", "سقز", "بانه", "مریوان", "قروه"],
  لرستان: ["خرم‌آباد", "بروجرد", "دورود", "الیگودرز", "کوهدشت"],
  مرکزی: ["اراک", "ساوه", "خمین", "محلات", "شازند"],
  مازندران: ["ساری", "بابل", "آمل", "قائم‌شهر", "نوشهر"],
  "آذربایجان غربی": ["ارومیه", "خوی", "میاندوآب", "مهاباد", "بوکان"],
  یزد: ["یزد", "میبد", "اردکان", "تفت", "مهریز"],
};

export function convertTimeFormat(isoString) {
  const date = new Date(isoString);
  const year = date.getFullYear();
  const month = date.getMonth() + 1; // Months are zero-indexed
  const day = date.getDate();

  return `${year}/${month}/${day}`;
}

export const convertDateToISO = (jalaliDate) => {
  const jalaliMoment = moment(jalaliDate, "jYYYY/jMM/jDD"); // Use 'jYYYY/jMM/jDD' to parse as Jalali

  const formattedDate = jalaliMoment.format("YYYY-MM-DDTHH:mm:ss");

  return `${formattedDate}Z`;
};

export const convertISOToDate = (isoDate) => {
  const gregorianMoment = moment(isoDate);

  const jalaliDate = gregorianMoment.format("jYYYY/jMM/jDD");

  return jalaliDate;
};
